*** TODO move auto-save-list and backups out of ~/.emacs.d
    :LOGBOOK:
    CLOCK: [2016-08-28 Sun 15:21]--[2016-08-28 Sun 15:21] =>  0:00
    :END:
    [2016-08-28 Sun 15:21]
    [[file:~/.emacs.d/auto-save-list][file:~/.emacs.d/auto-save-list]]

*** TODO bind f to eww-forward-url in eww
    :LOGBOOK:
    CLOCK: [2016-11-20 Sun 06:36]--[2016-11-20 Sun 06:37] =>  0:01
    :END:
    [2016-11-20 Sun 06:36]
*** TODO move bookmarks and eww-history out of ~/.emacs.d
    :LOGBOOK:
    CLOCK: [2016-11-20 Sun 06:40]--[2016-11-20 Sun 06:41] =>  0:01
    :END:
    [2016-11-20 Sun 06:40]
    - move to elisp-private or elisp-secret
*** DONE org9 not evaluating code blocks
    :LOGBOOK:
    CLOCK: [2016-11-06 Sun 10:32]--[2016-11-06 Sun 10:33] =>  0:01
    :END:
    [2016-11-06 Sun 10:32]
    Why am I getting this:
    =Evaluation of this emacs-lisp code-blockis disabled.=

    http://emacs.stackexchange.com/questions/28441/org-mode-9-unable-to-eval-code-blocks

    - resolved :: reinstall org-plus-contrib from melpa, set path to it
*** DONE Write wikipeida link inserter for word under point if URL exists
    SCHEDULED: <2016-09-10 Sat>
    :LOGBOOK:
    CLOCK: [2016-09-10 Sat 08:35]--[2016-09-10 Sat 08:36] =>  0:01
    :END:
    [2016-09-10 Sat 08:35]
    [[file:/usr/local/share/emacs/25.1.50/lisp/url/url-http.el.gz::(defun%20url-http-file-exists-p%20(url)]]
*** DONE set up emacs server so I can ssh in and connect
    :LOGBOOK:
    CLOCK: [2016-02-29 Mon 10:05]--[2016-02-29 Mon 10:05] =>  0:00
    :END:
    [2016-02-29 Mon 10:05]
    [[file:~/Org/refile.org]]
*** DONE Figure out a way to stop leaning on CTRL
    SCHEDULED: <2016-03-03 Thu>
    :LOGBOOK:
    CLOCK: [2016-03-03 Thu 04:28]--[2016-03-03 Thu 04:44] =>  0:16
    :END:
    [2016-03-03 Thu 04:28]
    [[file:~/elisp/keyfreq.el][file:~/elisp/keyfreq.el]]
    - I'm starting to get emacs pinky
    - Try using sticky keys http://xahlee.info/kbd/banish_key_chords.html
    - See http://ergoemacs.org/emacs/emacs_pinky.html
    - Consider http://ergoemacs.org/misc/ergoemacs_vi_mode.html
    - got two Kensis Advantage MPC/USB keyboard
*** DONE explore ways to always open files in readonly
    :LOGBOOK:
    CLOCK: [2016-08-30 Tue 09:49]--[2016-08-30 Tue 09:51] =>  0:02
    :END:
    [2016-08-30 Tue 09:49]
    I usually only edit one file at a time, but have 10s open.
    I want to have to explicity toggle read-only-mode.

    - resolution: C-x C-r		find-file-read-only
*** DONE figure out how to turn on linum-mode for source files
    :LOGBOOK:
    CLOCK: [2016-08-30 Tue 10:08]--[2016-08-30 Tue 10:08] =>  0:00
    :END:
    [2016-08-30 Tue 10:08]
    - resolution ::    =(add-hook 'python-mode-hook #'linum-on)=
*** TODO figure out how to record intermittent TODO actions (habits?)
    :LOGBOOK:
    CLOCK: [2016-11-30 Wed 07:22]--[2016-11-30 Wed 07:23] =>  0:01
    :END:
    [2016-11-30 Wed 07:22]
    [[file:~/home/private/home-computing/project_home-computing.org::*take%20a%20pass%20at%20cataloging%20my%20data,%20where%20it%20does/should%20live][take a pass at cataloging my data, where it does/should live]]
    -e.g. I have "Emacs config hacking" as a daily thing.  It's not.
    It's an occasional thing.  I want to record when I do it.  I don't
    want to plan to do it every day.
*** TODO add prefix to org-date-from-calendar to insert inactive timestamp
    :LOGBOOK:
    CLOCK: [2016-11-16 Wed 06:42]--[2016-11-16 Wed 06:43] =>  0:01
    :END:
    [2016-11-16 Wed 06:42]
    [[file:~/home/public/.emacs.d/elpa/org-plus-contrib-20161102/org.el::(defun%20org-date-from-calendar%20()]]
*** DONE CANCELED Start syncning to trllo
    SCHEDULED: <2016-02-28 Sun>
    :LOGBOOK:
    CLOCK: [2016-02-23 Tue 06:13]--[2016-02-23 Tue 06:14] =>  0:01
    :END:
    [2016-02-23 Tue 06:13]

    https://org-trello.github.io/install.html
    [[file:~/trello/honeyDo.org]]** TODO Figure out where to bind gmj/org-example-region		       :keys:
    [2016-02-23 Tue]
*** TODO Clean up, fix notmuch config for gmail
    :LOGBOOK:
    CLOCK: [2016-11-07 Mon 05:13]--[2016-11-07 Mon 05:15] =>  0:02
    :END:
    [2016-11-07 Mon 05:13]
    [[file:~/.emacs.d/george.org::*Email%20Config][Email Config]]
    - Set up offline-imap for gmail
    - Clean up george.org configs for notmuch
      + load consistently
      + install latest package
    - install offline imap

** TODO Make gmj-* lisp function loading and organization more consistant
   :LOGBOOK:
   CLOCK: [2017-01-28 Sat 05:47]--[2017-01-28 Sat 05:48] =>  0:01
   :END:
   [2017-01-28 Sat 05:47]
   [[file:~/.emacs.d/george.org::*Misc%20functions][Misc functions]]
   Either put them all in george.org or move them all to ~/elisp-*
** TODO Figure out how to transport/auto-install melpa packages across various emacs installs
   :LOGBOOK:
   CLOCK: [2017-01-31 Tue 07:13]--[2017-01-31 Tue 07:15] =>  0:02
   :END:
   [2017-01-31 Tue 07:13]
   #+begin_example
   e.g. set

   package-selected-packages

   to

   (better-shell which-key xah-fly-keys guide-key password-store org-plus-contrib notmuch magit go-mode twittering-mode htmlize yaml-mode pydoc))))

   and auto-install/load (out of init.el ?)
   #+end_example
*** TODO report bug in org9 - not honoring ":exports"
    :LOGBOOK:
    CLOCK: [2016-11-16 Wed 06:43]--[2016-11-16 Wed 06:45] =>  0:02
    CLOCK: [2016-11-16 Wed 06:24]--[2016-11-16 Wed 06:42] =>  0:18
    CLOCK: [2016-11-16 Wed 06:22]--[2016-11-16 Wed 06:23] =>  0:01
    CLOCK: [2016-11-16 Wed 06:22]--[2016-11-16 Wed 06:22] =>  0:00
    :END:
    [2016-11-16 Wed 06:22]
    [[file:~/home/secret/money/mint/testExports.org]]
